import asyncio

import os
import time
import datetime
import requests
from config import START_IMG_URL
from pyrogram import filters
import random
from pyrogram import Client
from pyrogram.types import Message, InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup
from strings.filters import command
from AnonX import (Apple, Resso, SoundCloud, Spotify, Telegram, YouTube, app)
from AnonX import app
from random import  choice, randint


@app.on_message(
    command(["اية","ايه"])
    & ~filters.edited)
async def azkar(c: Client, m: Message):
    if datetime.datetime.now().hour == 1 or datetime.datetime.now().hour == 4 or datetime.datetime.now().hour == 7 \
            or datetime.datetime.now().hour == 10 or datetime.datetime.now().hour == 13 \
            or datetime.datetime.now().hour == 16 or datetime.datetime.now().hour == 19 \
            or datetime.datetime.now().hour == 22:
        listAzkar = ["﴾لَّاۤ إِلَـٰهَ إِلَّاۤ أَنتَ سُبۡحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِینَ﴿",
                     " ﴾سُبۡحَـٰنَكَ لَا عِلۡمَ لَنَاۤ إِلَّا مَا عَلَّمۡتَنَاۤۖ إِنَّكَ أَنتَ ٱلۡعَلِیمُ ٱلۡحَكِیمُ﴿",
                     "﴾وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَاۤءࣱ وَرَحۡمَةࣱ لِّلۡمُؤۡمِنِینَ وَلَا یَزِیدُ ٱلظَّـٰلِمِینَ إِلَّا خَسَارࣰا﴿",
                     " ﴾فَأَمَّا ٱلۡیَتِیمَ فَلَا تَقۡهَرۡ﴿"
                     " ﴾ٱلَّذِی خَلَقَنِی فَهُوَ یَهۡدِینِ﴿ ",
                     "﴾وَٱلَّذِی هُوَ یُطۡعِمُنِی وَیَسۡقِینِ﴿ ",
                     "﴾وَإِذَا مَرِضۡتُ فَهُوَ یَشۡفِینِ﴿",
                     "﴾وَٱلَّذِی یُمِیتُنِی ثُمَّ یُحۡیِینِ﴿",
                     "﴾وَٱجۡعَلۡنِی مِن وَرَثَةِ جَنَّةِ ٱلنَّعِیمِ﴿",
                     "﴾قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلۡمُلۡكِ تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ بِیَدِكَ ٱلۡخَیۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ﴿",
                     "﴾تُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِۖ وَتُخۡرِجُ ٱلۡحَیَّ مِنَ ٱلۡمَیِّتِ وَتُخۡرِجُ ٱلۡمَیِّتَ مِنَ ٱلۡحَیِّۖ وَتَرۡزُقُ مَن تَشَاۤءُ بِغَیۡرِ حِسَابࣲ﴿",
                     "﴾رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَیۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ﴿",
                     "﴾رَبَّنَاۤ إِنَّكَ جَامِعُ ٱلنَّاسِ لِیَوۡمࣲ لَّا رَیۡبَ فِیهِۚ إِنَّ ٱللَّهَ لَا یُخۡلِفُ ٱلۡمِیعَادَ﴿",
                     "﴾قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِی یُحۡبِبۡكُمُ ٱللَّهُ وَیَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ﴿",
                     "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
                     "‏{ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ }",
                     "﴾ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ﴿",
                     "﴾إِنَّ ٱلۡأَبۡرَارَ لَفِی نَعِیمࣲ﴿",
                     "﴾‏إِنَّمَا وَلِیُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِینَ ءَامَنُوا۟ ٱلَّذِینَ یُقِیمُونَ ٱلصَّلَوٰةَ وَیُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَ ٰ⁠كِعُونَ﴿",
                     " ﴾إِنَّ ٱللَّهَ وَمَلَـٰۤئِكَتَهُۥ یُصَلُّونَ عَلَى ٱلنَّبِیِّۚ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ صَلُّوا۟ عَلَیۡهِ وَسَلِّمُوا۟ تَسۡلِیمًا﴿",
                     " ﴾فَقُلۡتُ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارࣰا﴿ ",
                     "﴾كُنتُمۡ خَیۡرَ أُمَّةٍ أُخۡرِجَتۡ لِلنَّاسِ تَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَتَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَتُؤۡمِنُونَ بِٱللَّهِۗ وَلَوۡ ءَامَنَ أَهۡلُ ٱلۡكِتَـٰبِ لَكَانَ خَیۡرࣰا لَّهُمۚ مِّنۡهُمُ ٱلۡمُؤۡمِنُونَ وَأَكۡثَرُهُمُ ٱلۡفَـٰسِقُونَ﴿",
                     "﴾‏مُّحَمَّدࣱ رَّسُولُ ٱللَّهِۚ وَٱلَّذِینَ مَعَهُۥۤ أَشِدَّاۤءُ عَلَى ٱلۡكُفَّارِ رُحَمَاۤءُ بَیۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعࣰا سُجَّدࣰا یَبۡتَغُونَ فَضۡلࣰا مِّنَ ٱللَّهِ وَرِضۡوَ ٰ⁠نࣰاۖ سِیمَاهُمۡ فِی وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَ ٰ⁠لِكَ مَثَلُهُمۡ فِی ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِی ٱلۡإِنجِیلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ یُعۡجِبُ ٱلزُّرَّاعَ لِیَغِیظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنۡهُم مَّغۡفِرَةࣰ وَأَجۡرًا عَظِیمَۢا﴿",
                     " ﴾إِنَّ ٱللَّهَ ٱصۡطَفَىٰۤ ءَادَمَ وَنُوحࣰا وَءَالَ إِبۡرَ ٰ⁠هِیمَ وَءَالَ عِمۡرَ ٰ⁠نَ عَلَى ٱلۡعَـٰلَمِینَ﴿",
                     "﴾إِنَّا نَحۡنُ نُحۡیِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُوا۟ وَءَاثَـٰرَهُمۡۚ وَكُلَّ شَیۡءٍ أَحۡصَیۡنَـٰهُ فِیۤ إِمَامࣲ مُّبِینࣲ﴿",
                     "﴾وَوَهَبۡنَا لَهُم مِّن رَّحۡمَتِنَا وَجَعَلۡنَا لَهُمۡ لِسَانَ صِدۡقٍ عَلِیࣰّا﴿",
                     "﴾وَإِنَّهُۥ فِیۤ أُمِّ ٱلۡكِتَـٰبِ لَدَیۡنَا لَعَلِیٌّ حَكِیمٌ﴿",
                     "﴾وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَیۡهِ مِنۡ حَبۡلِ ٱلۡوَرِیدِ﴿",
                     "﴾نَّحۡنُ أَعۡلَمُ بِمَا یَقُولُونَۖ وَمَاۤ أَنتَ عَلَیۡهِم بِجَبَّارࣲۖ فَذَكِّرۡ بِٱلۡقُرۡءَانِ مَن یَخَافُ وَعِیدِ﴿",
                     "﴾وَلَقَدۡ یَسَّرۡنَا ٱلۡقُرۡءَانَ لِلذِّكۡرِ فَهَلۡ مِن مُّدَّكِرࣲ﴿",
                     "﴾تَبَارَكَ ٱلَّذِیۤ إِن شَاۤءَ جَعَلَ لَكَ خَیۡرࣰا مِّن ذَ ٰ⁠لِكَ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ وَیَجۡعَل لَّكَ قُصُورَۢا﴿",
                     "﴾وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوۤا۟ إِلَّاۤ إِیَّاهُ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنًاۚ إِمَّا یَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَاۤ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَاۤ أُفࣲّ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلࣰا كَرِیمࣰا﴿",
                     "﴾وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّیَانِی صَغِیرࣰا﴿",
                     "﴾‏وَٱسۡتَعِینُوا۟ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِیرَةٌ إِلَّا عَلَى ٱلۡخَـٰشِعِینَ﴿",
                     "﴾‏یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱسۡتَعِینُوا۟ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِینَ﴿",
                     "﴾یَـٰبَنِیۤ ءَادَمَ خُذُوا۟ زِینَتَكُمۡ عِندَ كُلِّ مَسۡجِدࣲ وَكُلُوا۟ وَٱشۡرَبُوا۟ وَلَا تُسۡرِفُوۤا۟ۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ﴿",
                     "﴾وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِی ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا یُحِبُّ كُلَّ مُخۡتَالࣲ فَخُورࣲ﴿",
                     "﴾وَٱقۡصِدۡ فِی مَشۡیِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَ ٰ⁠تِ لَصَوۡتُ ٱلۡحَمِیرِ﴿",
                     "﴾وَمَن یَظۡلِم مِّنكُمۡ نُذِقۡهُ عَذَابࣰا كَبِیرࣰا﴿",
                     "﴾وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ قِیلࣰا﴿"
                     " ﴾یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمۡ وَٱخۡشَوۡا۟ یَوۡمࣰا لَّا یَجۡزِی وَالِدٌ عَن وَلَدِهِۦ وَلَا مَوۡلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَیۡـًٔاۚ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ﴿",
                     "﴾یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ﴿",
                     " ﴾یَـٰۤأَیُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَاۤءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ﴿",
                     "﴾یَـٰۤأَیُّهَا ٱلنَّاسُ ٱعۡبُدُوا۟ رَبَّكُمُ ٱلَّذِی خَلَقَكُمۡ وَٱلَّذِینَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ﴿",
                     "﴾إِنَّ ٱللَّهَ رَبِّی وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَـٰذَا صِرَ ٰ⁠طࣱ مُّسۡتَقِیمࣱ﴿",
                     "﴾‏وَٱعۡبُدُوا۟ ٱللَّهَ وَلَا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰا وَبِذِی ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینِ وَٱلۡجَارِ ذِی ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِیلِ وَمَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا﴿",
                     "﴾لَقَدۡ كَفَرَ ٱلَّذِینَ قَالُوۤا۟ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِیحُ ٱبۡنُ مَرۡیَمَۖ وَقَالَ ٱلۡمَسِیحُ یَـٰبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱعۡبُدُوا۟ ٱللَّهَ رَبِّی وَرَبَّكُمۡۖ إِنَّهُۥ مَن یُشۡرِكۡ بِٱللَّهِ فَقَدۡ حَرَّمَ ٱللَّهُ عَلَیۡهِ ٱلۡجَنَّةَ وَمَأۡوَىٰهُ ٱلنَّارُۖ وَمَا لِلظَّـٰلِمِینَ مِنۡ أَنصَارࣲ﴿*",
                     "﴾‏ٱلَّذِینَ یُنفِقُونَ فِی ٱلسَّرَّاۤءِ وَٱلضَّرَّاۤءِ وَٱلۡكَـٰظِمِینَ ٱلۡغَیۡظَ وَٱلۡعَافِینَ عَنِ ٱلنَّاسِۗ وَٱللَّهُ یُحِبُّ ٱلۡمُحۡسِنِینَ﴿",
                     "﴾وَٱلَّذِینَ إِذَا فَعَلُوا۟ فَـٰحِشَةً أَوۡ ظَلَمُوۤا۟ أَنفُسَهُمۡ ذَكَرُوا۟ ٱللَّهَ فَٱسۡتَغۡفَرُوا۟ لِذُنُوبِهِمۡ وَمَن یَغۡفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمۡ یُصِرُّوا۟ عَلَىٰ مَا فَعَلُوا۟ وَهُمۡ یَعۡلَمُونَ﴿",
                     "﴾وَبَشِّرِ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ كُلَّمَا رُزِقُوا۟ مِنۡهَا مِن ثَمَرَةࣲ رِّزۡقࣰا قَالُوا۟ هَـٰذَا ٱلَّذِی رُزِقۡنَا مِن قَبۡلُۖ وَأُتُوا۟ بِهِۦ مُتَشَـٰبِهࣰاۖ وَلَهُمۡ فِیهَاۤ أَزۡوَ ٰ⁠جࣱ مُّطَهَّرَةࣱۖ وَهُمۡ فِیهَا خَـٰلِدُونَ﴿",
                     "﴾یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا نُودِیَ لِلصَّلَوٰةِ مِن یَوۡمِ ٱلۡجُمُعَةِ فَٱسۡعَوۡا۟ إِلَىٰ ذِكۡرِ ٱللَّهِ وَذَرُوا۟ ٱلۡبَیۡعَۚ ذَ ٰ⁠لِكُمۡ خَیۡرࣱ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ﴿",
                     "﴾فَٱسۡتَجَبۡنَا لَهُۥ وَنَجَّیۡنَـٰهُ مِنَ ٱلۡغَمِّۚ وَكَذَ ٰ⁠لِكَ نُـۨجِی ٱلۡمُؤۡمِنِینَ﴿ ",
                     "﴾‏إِنَّنِیۤ أَنَا ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّاۤ أَنَا۠ فَٱعۡبُدۡنِی وَأَقِمِ ٱلصَّلَوٰةَ لِذِكۡرِیۤ﴿",
                     "﴾لَا یُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَیۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَاۤ إِن نَّسِینَاۤ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَیۡنَاۤ إِصۡرࣰا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِینَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۤۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ﴿",
                     "﴾یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ كُلُوا۟ مِن طَیِّبَـٰتِ مَا رَزَقۡنَـٰكُمۡ وَٱشۡكُرُوا۟ لِلَّهِ إِن كُنتُمۡ إِیَّاهُ تَعۡبُدُونَ﴿",
                     "﴾وَظَلَّلۡنَا عَلَیۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَیۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُوا۟ مِن طَیِّبَـٰتِ مَا رَزَقۡنَـٰكُمۡۚ وَمَا ظَلَمُونَا وَلَـٰكِن كَانُوۤا۟ أَنفُسَهُمۡ یَظۡلِمُونَ﴿",
                     " ﴾ٱلَّذِینَ یُؤۡمِنُونَ بِٱلۡغَیۡبِ وَیُقِیمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ﴿",
                     "﴾وَٱلَّذِینَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔایَـٰتِنَاۤ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ﴿",
                     "﴾رَبَّنَاۤ ءَاتِنَا فِی ٱلدُّنۡیَا حَسَنَةࣰ وَفِی ٱلۡـَٔاخِرَةِ حَسَنَةࣰ وَقِنَا عَذَابَ ٱلنَّارِ﴿",
                     " ﴾وَمَا لَهُم بِهِ مِنْ عِلْمٍ ۖ إِن يَتَّبِعُونَ إِلَّا الظَّنَّ ۖ وَإِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا﴿",
                     "﴾يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ تَوَّابٌ رَّحِيمٌ﴿",
                     "﴾یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَـٰكُم مِّن ذَكَرࣲ وَأُنثَىٰ وَجَعَلۡنَـٰكُمۡ شُعُوبࣰا وَقَبَاۤىِٕلَ لِتَعَارَفُوۤا۟ۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِیمٌ خَبِیرࣱ﴿",
                     "﴾قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُوا۟ وَلَـٰكِن قُولُوۤا۟ أَسۡلَمۡنَا وَلَمَّا یَدۡخُلِ ٱلۡإِیمَـٰنُ فِی قُلُوبِكُمۡۖ وَإِن تُطِیعُوا۟ ٱللَّهَ وَرَسُولَهُۥ لَا یَلِتۡكُم مِّنۡ أَعۡمَـٰلِكُمۡ شَیۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمٌ﴿",
                     "﴾إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ یَرۡتَابُوا۟ وَجَـٰهَدُوا۟ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ فِی سَبِیلِ ٱللَّهِۚ أُو۟لَـٰۤىِٕكَ هُمُ ٱلصَّـٰدِقُونَ﴿",
                     "﴾إِنَّ ٱللَّهَ یَعۡلَمُ غَیۡبَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِیرُۢ بِمَا تَعۡمَلُونَ﴿",
                     "﴾سَیَقُولُ ٱلَّذِینَ أَشۡرَكُوا۟ لَوۡ شَاۤءَ ٱللَّهُ مَاۤ أَشۡرَكۡنَا وَلَاۤ ءَابَاۤؤُنَا وَلَا حَرَّمۡنَا مِن شَیۡءࣲۚ كَذَ ٰ⁠لِكَ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ حَتَّىٰ ذَاقُوا۟ بَأۡسَنَاۗ قُلۡ هَلۡ عِندَكُم مِّنۡ عِلۡمࣲ فَتُخۡرِجُوهُ لَنَاۤۖ إِن تَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ أَنتُمۡ إِلَّا تَخۡرُصُونَ﴿",
                     "﴾وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِیحَ عِیسَى ٱبۡنَ مَرۡیَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِ لَفِی شَكࣲّ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ یَقِینَۢا﴿",
                     "﴾لَّقَدۡ كَفَرَ ٱلَّذِینَ قَالُوۤا۟ إِنَّ ٱللَّهَ ثَالِثُ ثَلَـٰثَةࣲۘ وَمَا مِنۡ إِلَـٰهٍ إِلَّاۤ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۚ وَإِن لَّمۡ یَنتَهُوا۟ عَمَّا یَقُولُونَ لَیَمَسَّنَّ ٱلَّذِینَ كَفَرُوا۟ مِنۡهُمۡ عَذَابٌ أَلِیمٌ﴿",
                     "﴾وَٱعۡتَصِمُوا۟ بِحَبۡلِ ٱللَّهِ جَمِیعࣰا وَلَا تَفَرَّقُوا۟ۚ وَٱذۡكُرُوا۟ نِعۡمَتَ ٱللَّهِ عَلَیۡكُمۡ إِذۡ كُنتُمۡ أَعۡدَاۤءࣰ فَأَلَّفَ بَیۡنَ قُلُوبِكُمۡ فَأَصۡبَحۡتُم بِنِعۡمَتِهِۦۤ إِخۡوَ ٰ⁠نࣰا وَكُنتُمۡ عَلَىٰ شَفَا حُفۡرَةࣲ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنۡهَاۗ كَذَ ٰ⁠لِكَ یُبَیِّنُ ٱللَّهُ لَكُمۡ ءَایَـٰتِهِۦ لَعَلَّكُمۡ تَهۡتَدُونَ﴿",
                     "﴾وَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَقۡرِضُوا۟ ٱللَّهَ قَرۡضًا حَسَنࣰاۚ وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنۡ خَیۡرࣲ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَیۡرࣰا وَأَعۡظَمَ أَجۡرࣰاۚ وَٱسۡتَغۡفِرُوا۟ ٱللَّهَۖ إِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمُۢ﴿"]
        await c.send_message(m.chat.id, random.choice(listAzkar))
        
